---
kind: property
id: P:Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs.NewInstanceId
source: html/4859f4fa-bcc6-b7c9-bae0-cefdca0980a2.htm
---
# Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs.NewInstanceId Property

The newly added external data instance id.

## Syntax (C#)
```csharp
public ElementId NewInstanceId { get; }
```